// 整个网页分为左中右三部分，左部分和右部分从上往下又分为左1，左2，左3以及右1，右2，右3




///////////////////////////  左部分  ///////////////////////////////////////
//左1 title和company相同次序内容一一对应，一共5组，title最多10个字，company最多7个字
var l1_title = {
    "name": ['虚拟电厂技术及应用', '虚拟电厂技术及应用', '虚拟电厂技术及应用', '虚拟电厂技术及应用', '虚拟电厂技术及应用'],
}
var l1_company = {
    "name": ['北京议城共创', '北京议城共创', '北京议城共创', '北京议城共创', '北京议城共创'],
}

// 左2 网状图  name和value相同次序内容一一对应
var l2_net = {
    "name": ['信息技术', '节能环保', '生物医药', '集成电路', '新材料及其他', '装备制造与航天航空'],
    "value": [50, 10, 8, 15, 6, 18]
}


// 左3 
var l3 = {
    "l3_1": "企业企业企业1",
    "l3_2": "企业企业企业2",
    "l3_3": "企业企业企业3",
    "l3_4": "企业企业企业4",
    "l3_5": "企业企业企业5",
    "l3_6": "企业企业企业6",
    "l3_7": "企业企业企业7",
}






///////////////////////////////// 中间部分 //////////////////////////////////
// 中间上半部分有四组 ”数字-名称“，num和name相同次序一一对应
var center = {
    "num": ["5800", "278", "6000", "43"],
    "name": ["成果库数量", "在促项目数量", "企业注册数据", "所发布需求数据(条)"]
}







///////////////////////////////// 右部分 //////////////////////////////////
// 右1  往images文件夹添加图片，命名格式为r1_1.jpg到r1_10.jpg
// 并往下面r1中添加对应的项目名称，r1.name第一次序内容对应r1_1.jpg，r1.name第二次序内容对应r1_2.jpg，以此类推一一对应。
// 最多不超过16个字！！
var r1 = {
    "name": ["项目名称项目名称项目名称项目名称", "项目名称项目2", "项目名称项目3", "项目名称项目4", "项目名称项目5", "项目名称项目6", "项目名称项目7", "项目名称项目8", "项目名称项目9", "项目名称项目10"],
}



// 右2 柱状图  
// name对应每个数据柱的名字，data对应柱的标注大小，percentage对应柱大小的百分比，也是柱的实际大小
var r_bar = {
    "name": ['信息技术', '节能环保', '生物医药', '集成电路', '新材料及其他', '装备制造与航天航空'],
    "data": [50, 10, 8, 15, 6, 18],
    "percentage": [90, 60, 80, 80, 80, 60]
}


// 右3 分为两列，r3l是左边显示内容，r3r是右边显示内容，且r3l和r3r一一对应。
var r3l = {
    "r3l_1": "签约企业签约企业1",
    "r3l_2": "签约企业签约企业2",
    "r3l_3": "签约企业签约企业3",
    "r3l_4": "签约企业签约企业4",
    "r3l_5": "签约企业签约企业5",
    "r3l_6": "签约企业签约企业6",
    "r3l_7": "签约企业签约企业7",
    "r3l_8": "签约企业签约企业8",
    "r3l_9": "签约企业签约企业9",
    "r3l_10": "签约企业签约企业10"
}
var r3r = {
    "r3r_1": "北京",
    "r3r_2": "上海",
    "r3r_3": "深圳",
    "r3r_4": "北京",
    "r3r_5": "上海",
    "r3r_6": "深圳",
    "r3r_7": "上海",
    "r3r_8": "上海",
    "r3r_9": "深圳",
    "r3r_10": "上海"
}